Table of Contents
 Class SubStructure
Namespace
IdeaRS.OpenModel.Model
Assembly
IdeaRS.OpenModel.dll
SubStructure
[OpenModelClass("CI.StructModel.Structure.SubStructure,CI.StructuralElements", "CI.StructModel.Structure.ISubStructure,CI.BasicTypes")]
public class SubStructure : OpenElementId
Inheritance
object
OpenObject
OpenElementId
SubStructure
Inherited Members
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 SubStructure()
Constructor
public SubStructure()
Properties
 Geometry
Geometry
public SubStructureGeometry Geometry { get; set; }
Property Value
SubStructureGeometry
 Loading
Loading
public SubStructureLoading Loading { get; set; }
Property Value
SubStructureLoading
 Name
Name
public string Name { get; set; }
Property Value
string
 Edit this page